## Unique Values in Pandas Dataframes

### Paulo Cysne Rios Jr | Oct 23, 2017

In [12]:
import numpy as np
import pandas as pd

In [13]:
scores = {"student": ["John", "Mary", "Robert", 
                        "John", "Robert", "Robert", "Mary"],
          "subject": ["Algebra", "Physics", "Algebra",
                       "Calculus", "Calculus", "Physics", "Algebra"],
          "grade": [2.8, 3.5, 3.2, 3.8, 2.9, 3.1, 3.5] }

In [14]:
scores_df = pd.DataFrame(scores)

In [15]:
scores_df

   grade student   subject
0    2.8    John   Algebra
1    3.5    Mary   Physics
2    3.2  Robert   Algebra
3    3.8    John  Calculus
4    2.9  Robert  Calculus
5    3.1  Robert   Physics
6    3.5    Mary   Algebra

In [16]:
scores_df["student"].unique()

array(['John', 'Mary', 'Robert'], dtype=object)

In [17]:
scores_df["student"].nunique()

3

In [18]:
scores_df["student"].value_counts()

Robert    3
John      2
Mary      2
Name: student, dtype: int64